nerd_food/2009_year_of_world_domination.org
#+title: Nerd Food: 2009: Year of World Domination?
#+author: Marco Craveiro
#+options: num:nil author:nil toc:nil
#+bind: org-html-validation-link nil
#+HTML_HEAD: <link rel="stylesheet" href="../css/tufte.css" type="text/css" />

| [[file:index.org][Back to essay index]] | [[file:../index.org][Back to home page]] |

#+begin_quote
Ninety-Ninety Rule: n. The first 90% of the code accounts for the
first 90% of the development time. The remaining 10% of the code
accounts for the other 90% of the development time. -- Jargon
#+end_quote

Sunday, February 1, 2009

* World Domination Revisited

It's hard to believe, but it has been almost two years since I ranted
on World Domination. Two years have rolled by, and it seems
appropriate to resume the theme, but from a slightly different angle.

So, lets cut to the chase. Will 2009 be the Year of the Linux Desktop?
The short answer is no, and I think its now clear it will apply to
2010, 2011 and so on. In fact, in 2009 we won't even meet the looser
definition of World Domination I proposed, although we're getting
closer.

What has happened since 2007? Well, we became a lot more popular in
the desktop segment, in particular on the whole new category of MIDs
and netbooks; at one point we entirely dominated it, but over time
normal computing trends reasserted themselves. According to the latest
figures, Linux now ships on around 10-15% of new netbooks, as opposed
to the incredible 100% we had in the beginning. Netbooks had the
highest visibility, but, to be fair, some inroads were made on all
usual areas including server and regular desktop markets. Good, but
nothing jaw dropping.

So we find ourselves, two years later, asking ourselves the age old
questions. Why haven't we seen at least one significant large
migration? Why didn't one of the multinational companies punt on a
100K RedHat or Novell desktop migration?

