nerd_food/2009_year_of_world_domination.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-28 Sun 16:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nerd Food: 2009: Year of World Domination?</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Nerd Food: 2009: Year of World Domination?</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="index.html">Back to essay index</a></td>
<td class="org-left"><a href="../index.html">Back to home page</a></td>
</tr>
</tbody>
</table>

<div class="epigraph"><blockquote>
<p>
Ninety-Ninety Rule: n. The first 90% of the code accounts for the
first 90% of the development time. The remaining 10% of the code
accounts for the other 90% of the development time. &#x2013; Jargon
</p>

</blockquote></div>

<p>
Sunday, February 1, 2009
</p>

<div id="outline-container-orgdefd8f1" class="outline-2">
<h2 id="orgdefd8f1">World Domination Revisited</h2>
<div class="outline-text-2" id="text-orgdefd8f1">
<p>
It's hard to believe, but it has been almost two years since I ranted
on World Domination. Two years have rolled by, and it seems
appropriate to resume the theme, but from a slightly different angle.
</p>

<p>
So, lets cut to the chase. Will 2009 be the Year of the Linux Desktop?
The short answer is no, and I think its now clear it will apply to
2010, 2011 and so on. In fact, in 2009 we won't even meet the looser
definition of World Domination I proposed, although we're getting
closer.
</p>

<p>
What has happened since 2007? Well, we became a lot more popular in
the desktop segment, in particular on the whole new category of MIDs
and netbooks; at one point we entirely dominated it, but over time
normal computing trends reasserted themselves. According to the latest
figures, Linux now ships on around 10-15% of new netbooks, as opposed
to the incredible 100% we had in the beginning. Netbooks had the
highest visibility, but, to be fair, some inroads were made on all
usual areas including server and regular desktop markets. Good, but
nothing jaw dropping.
</p>

<p>
So we find ourselves, two years later, asking ourselves the age old
questions. Why haven't we seen at least one significant large
migration? Why didn't one of the multinational companies punt on a
100K RedHat or Novell desktop migration?
</p>
</div>
</div>
