nerd_food/2009_year_of_world_domination.html

<div id="outline-container-orgb1835b4" class="outline-2">
<h2 id="orgb1835b4">A Maturing Industry</h2>
<div class="outline-text-2" id="text-orgb1835b4">
<p>
For those who, like me, have been using Linux for over a decade, there
always has been a lingering feeling, an idea on the back of one's mind
insisting that one day the world would suddenly get it: the herd would
finally see the light and the big mass migration would
begin. Microsoft's time would come to an end, just as the once
unassailable empires of IBM and DEC eventually faded. But time has
gone by, the public has been exposed to Free Software, and yet no
major visible changes have occurred. On the plus side, all these years
of waiting gave us plenty of data points to calibrate our
understanding of the software industry. Perhaps now we can begin to
build a model that explains why things turned out the way they did.
</p>

<p>
Looking back, one of the key things one cannot fail to notice is how
the world has changed in the last twenty years. The world in which I
was brought up was a world of fast paced change, of great volatility:
companies sprung from nowhere, dominated the market and then
disappeared as if they never existed. Sinclair'sZX Spectrum,
Commodore's C-64 and Amiga, Tandy's machines and so many other brands
came and went, all in the blink of an eye. Those were heady times. It
happened during so long a period that one started to believe this was
the way of the world: a superior product immediately bought by a
significant critical mass of consumers, only to be dumped as soon as a
new leader emerged.
</p>

<p>
But the computer world was small then, and it belonged mainly to
geeks. The homebrew generation had receded into the shade a bit, to be
sure, and mass production took over; things got easier for
users. However, the target market was still tiny, and still mainly
composed of dedicated people willing to put in the hours to get things
to work.
</p>

<p>
Non-geeks &#x2014; particularly suits &#x2014; viewed the wild west mentality of
the technology sector in a completely different light. For them, it
was a serious problem. The technology was promising and the killer
applications were beginning to appear, but caution ruled the
day. After all, one could invest a considerable amount of money on
hardware and software, make a glorious 3 year plan with all bells and
whistles, only to find out that the vendors had folded, or gave up on
the products entirely. This was no way to run a business.
</p>

<p>
Microsoft saw it clearly and responded by talking the language
business wanted to hear. It was time for "workgroups" and "solutions",
for "office" and "enterprise". Windows 3.11 was a great step on that
direction but, SWAGing somewhat, I'd say Windows 95 was the
cornerstone. It marked the end of the wild frontier days, and signaled
the consolidation of the new world order. Microsoft's strategies, much
like those of a Machiavellian prince, were focused on stabilisation
through domination. It was nasty, but extremely effective. Their
dominance achieved what business most wanted, which was predictability
and standardisation. Here was, finally, a solid ground on which to
plan.
</p>

<p>
The result was explosive. Microsoft went from a small vendor in a
highly competitive market to the dominant force. By creating
standards &#x2014; however closed one may consider them to be &#x2014; the
company helped expand exponentially the overall size of the market,
and developed a vital symbiosis with business. Each release of Windows
provided both stability (through flawless backwards compatibility) and
a dazzling number of new features; and each release was delivered at a
rate which fit nicely with business' need for planning.
</p>

<p>
And so the world went, in this nice happy fashion, from Windows 95 to
Windows 98, NT 3.5, to NT 4, Windows 2000 to Windows XP. What
Microsoft managed to achieve between Windows 95 and XP was
ubiquity. Suddenly everyone everywhere was using Windows and Office,
and the numbers were huge. Immense. The geeks were finally,
completely, totally, utterly dwarfed by the non-geeks.
</p>

<p>
XP was a landmark release in more ways than one, though. It is with XP
that we meet our second inflection point, at which the symbiosis
between Microsoft and business started to breakdown. Until XP business
never really questioned the upgrade cycle: hardware grew so much
faster from one year to the next that it made perfect sense to upgrade
machines regularly. Software in itself also suffered dramatic
improvements from release to release, benefiting those who kept up
with the times. Being at the cusp of the wave was a competitive
advantage.
</p>

<p>
But with XP, strange things begun to happen:
</p>

<ul class="org-ul">
<li>Moore's law hit a social barrier; suddenly people stopped wanting
the fastest PCs and started looking instead for other things such as
peripherals, bigger and better monitors, etc. And much more
importantly, low end PCs became good enough for the vast majority of
tasks.</li>
<li>Microsoft's products went from being seen as the cheap alternative
to expensive brands, to the expensive brand with no real
alternatives. The operative system cost became a significant part of
the overall PC cost.</li>
<li>Upgrade fatigue kicked in, and many companies begun to ask just
exactly why there was a need to change the entire estate so
frequently.</li>
<li>The size of the PC market became so large that it just wasn't
feasible for a large part of it to quickly upgrade as it had
happened in the past.</li>
</ul>

<p>
In short, the PC market started showing signs of maturity. Microsoft's
objective &#x2014; their attempt to stabilise and standardise the PC market
&#x2014; had been achieved; but at the same time, its success may have
brought about great difficulties for the company. Seen in this light,
Vista's problems are not so much technical. There may be a number of
significant issues with the operative system &#x2014; although most Windows
users I regularly speak to seem to be pretty happy with it. It has its
rough edges, but so did XP in the beginning and Windows 95 before it,
and that didn't stop them from being huge successes.
</p>

<p>
What has changed fundamentally is the relationship between Microsoft
and its user base. There just isn't any need for mass upgrades any
more, and the more constrained IT budgets get, the more obvious this
becomes. After all, Vista was extremely successful on the new PC
segment; it struggled more when trying to convince existing PC owners
to upgrade. I am strongly convinced that Windows 7 will suffer the
same fate. The crucial element on its adoption is going to be the End
Of Life of XP, because no business will want to run a product that is
no longer supported by its creator. When EOL is declared for XP , all
business will start to migrate to Windows 7 &#x2014; but not before
then. They are more than happy with it; it works, it's well supported
and more importantly, "they know how it behaves". The learning curve
will start from scratch, be it Vista or Windows 7, and, from a
commercial perspective, for no particularly good reason.
</p>

<p>
In truth, business need only a platform that is:
</p>

<ul class="org-ul">
<li>good enough (in which case they won't change)</li>
<li>compellingly better (in which case they will want to change)</li>
<li>compellingly cheaper (in which case they will be made to change by
external pressures)</li>
</ul>

<p>
Its becoming harder and harder to create software that is so
compellingly better that would make users upgrade. And Microsoft
cannot start a cannibalisation strategy based on price, because its
business model is based on the notion that products become
progressively more expensive (after all their R&amp;D costs increase
dramatically from release to release, in the illusive search for
killer features). The only weapon left to the company is to force
customers to upgrade by whatever other means available &#x2014; such
asEOLing products. This can only be done for so long until business
wises up.
</p>

<p>
It is in the midst of this carnage that Mac and Free Software products
are competing. In view of this, one can conclude that no one &#x2014;
Microsoft included &#x2014; will have an easy ride convincing large numbers
of existing users, business or home, to switch. The real fight for
change is going to happen on the fringes of the PC market, the beaches
where those new machines are being sold.
</p>

<p>
Here, there are two weapons available to Free Software: technological
superiority and price.
</p>
</div>
</div>
